Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_2 (KerasLayer)   (None, 20)                400020    
_________________________________________________________________
dense_3 (Dense)              (None, 60)                1260      
_________________________________________________________________
dense_4 (Dense)              (None, 25)                1525      
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 26        
=================================================================
Total params: 402,831
Trainable params: 402,831
Non-trainable params: 0
_________________________________________________________________